
clear;clc;
data=[0.4036 	10.41	3.79	18.2	636.64
    0.1662 	2.66	3.73	5.63	1015.05
    0.2845 	1.57	3.94	19.41	648.78
    0.3162 	6.92	4.18	20.38	649.06
    0.3231 	40.89	3.98	22.89	616.55
    0.3736 	11.7	3.85	12.19	592.17
    0.2876 	40.89	4	11.41	678.86
    0.2822 	4.73	4	18.9	841.95
    0.5865 	40.89	4	11.11	552.7
    0.4491 	5.52	4.97	17.01	1014.98
    0.5347 	40.89	4	15.65	467.31
    0.5477 	1.02	3.53	7.9	632
    0.4637 	40.89	4	12.45	609.88
    0.4867 	6.21	3.67	13.9	701.38
    0.4191 	2.19	3.17	15.88	838.85
    0.4928 	6	4	16.17	497.57
    0.5158 	4.71	3.83	16.4	648.46
    0.3852 	4.18	3.9	14.37	430.3
    0.3908 	40.89	4	11.88	531.15
    0.3524 	6.19	3.58	12.94	598.34 ];
%获取行数列数
r = size(data,1);
c = size(data,2);
%首先，把我们的原始指标矩阵正向化
%第三列极小型--->极大型
%把正向化后的矩阵进行预处理，消除量纲的影响
avg = repmat(mean(data),r,1);
new_data = data./avg;
%将预处理后的矩阵每一行的最大值取出，当成母序列(虚构的)
Y = max(new_data,[],2);
%计算各个指标和母序列的灰色关联度
%先把new_data矩阵所有元素都减去母序列中同行的元素，并取绝对值
Y2 = repmat(Y,1,c);
new_data = abs(new_data-Y2);
a = min(min(new_data)); %全矩阵最小值
b = max(max(new_data)); %全矩阵最大值
ro = 0.5;
new_data = (a+ro*b)./(new_data+ro*b);
disp("各个指标对于母序列的灰色关联度为：");
gamma = mean(new_data);
%计算各个指标的权重
disp("各个指标的权重为：");
weight = gamma./(sum(gamma,2));