%% 云模型，将data数据替换成自己的数据即可
% Author：包子
% QQ/V：472770120
% x 表示云滴
% ux 表示隶属度（这里是“钟形”隶属度），意义是度量倾向的稳定程度
% Ex 云模型的数字特征，表示期望
% En 云模型的数字特征，表示熵
% He 云模型的数字特征，表示超熵

clc;clear all;close all;
%每列为一组，替换成自己的数据
data = [4.5000   10.3000   15.1000   18.1000
    5.3000    9.7000   15.4000   20.1000
    5.6000    8.6000   14.2000   20.0000
    5.5000   10.4000   15.1000   20.1000
    5.9000    9.8000   15.0000   20.1000
    5.6000    9.8000   14.7000   20.0000
    5.4000   10.5000   15.6000   20.3000
    5.1000   10.2000   15.8000   18.4000
    4.3000   10.2000   14.6000   20.0000
    5.5000   10.0000   15.7000   19.9000];

%用原始数据计算云特征Ex、En、He
Ex = mean(data);
En = mean(abs(data-Ex)).*sqrt(pi./2);
He = sqrt(var(data)-En.^2);
%云滴个数
n = 5000;
%绘图
figure(1)
for i = 1:length(Ex)
    for j = 1:n
        %计算以En为期望值，He^2为方差的正态随机En'
        En1 = normrnd(En(i),He(i),1);
        %计算以Ex为期望值，En'^2为方差的正态随机x
        x(j) = normrnd(Ex(i),En1,1);
        ux(j) = exp(-( x(j)-Ex(i))^2/(2*(En1^2)));
    end
    plot(x,ux,'.')
    hold on
end
legend('张三','李四','王五','赵六')



