%依次为：惩，不激不惩，激，强激，惩，不激不惩...
w0=[];  %常权
w=[];   %理想权重
x=[];   %样本构建,行向量
d=[];   %变权区间

%c,a1,a2,a3
a=size(w,2);
k1=(w0(2)-w0(2)*(sum(w(1:4)))-w(2)*(sum(w0(5:a))))/(w(2)*w0(5));
k2=(w(1)*w0(2)-w(2)*w0(1))/(w(2)*w0(1));
k3=(d(5,1)-x(5))/(d(1,1)-x(1));     %为使eq1有非零解，样本构建最好使k3=2
syms c
eqn1=k1*c==(k2*c+1)^k3-1;
c=vpasolve(eqn1,c)
a1=(1/(d(1,1)-x(1)))*log(((w(1)*w0(2)-w(2)*w0(1))/(w(2)*w0(1)))*c+1);
a2=(1/(x(3)-d(3,2)))*log(((w(3)*w0(2)-w(2)*w0(3))/(w(2)*w0(3)))*c+1);
a3=(1/(x(4)-d(4,3)))*log(((w(4)*w0(2)-w(2)*w0(4))/(w(2)*w0(4)))*c+2-(((w(3)*w0(2)-w(2)*w0(3))/(w(2)*w0(3)))*c+1)^((d(4,3)-d(4,2))/(x(3)-d(3,2))));

%各样本变权值
X=[];           %行向量
[e,f]=size(X);  %e=样本数，f=指标个数
S=[];           %变权向量
for j=1:f
    for i=1:e
        if X(i,j)>=0&&X(i,j)<d(j,1)
            S(i,j)=exp(a1*(d(j,1)-X(i,j)))+c-1
        elseif X(i,j)>=d(j,1)&&X(i,j)<d(j,2)
            S(i,j)=c
        elseif X(i,j)>=d(j,2)&&X(i,j)<d(j,3)
            S(i,j)=exp(a2*(X(i,j)-d(j,2)))+c-1
        elseif X(i,j)>=d(j,3)&&X(i,j)<=1
            S(i,j)=exp(a3*(X(i,j)-d(j,3)))+exp(a2*(d(j,3)-d(j,2)))+c-2
        end
    end
end
W_S=[];     %常权w0*变权向量S
S0=[];      %变权结果
for j=1:f
    for i=1:e
        W_S(i,j)=w0(1,j)*S(i,j)
    end
end
for i=1:e
    for j=1:f
        S0(i,j)=W_S(i,j)/sum(W_S(i,:))
    end
end
%检查极小值与极大值

